
# State **`s3://infrahouse-aws-control-303467602807/terraform.tfstate`**
## Affected resources counts

|   Success |   🟢 Add |   🟡 Change |   🔴 Destroy |
|----------:|---------:|------------:|-------------:|
|        ✅ |       10 |           7 |            9 |
## Affected resources by action

|  Action  | Resources                                                                      |
|:--------:|:-------------------------------------------------------------------------------|
|    🟢    | `module.actions-runner.module.record_metric.aws_s3_object.lambda_package`      |
|    🟡    | `module.actions-runner.aws_autoscaling_group.actions-runner`                   |
|    🟡    | `module.actions-runner-noble.aws_autoscaling_group.actions-runner`             |
|    🟡    | `module.actions-runner-noble.aws_autoscaling_policy.scale_out`                 |
|    🟡    | `module.actions-runner.module.record_metric.aws_lambda_function.lambda`        |
|    🟡    | `module.actions-runner-noble.module.deregistration.aws_lambda_function.lambda` |
|    🟡    | `module.actions-runner-noble.module.record_metric.aws_lambda_function.lambda`  |
|    🟡    | `module.actions-runner-noble.module.registration.aws_lambda_function.main`     |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.actions-runner.aws_autoscaling_group.actions-runner will be updated in-place
  ~ resource "aws_autoscaling_group" "actions-runner" {
        id                               = "actions-runner-20250505203133108100000007-INx3ry"
      ~ max_size                         = 3 -> 1
        name                             = "actions-runner-20250505203133108100000007-INx3ry"
        # (30 unchanged attributes hidden)

        # (14 unchanged blocks hidden)
    }

  # module.actions-runner-noble.aws_autoscaling_group.actions-runner will be updated in-place
  ~ resource "aws_autoscaling_group" "actions-runner" {
      ~ health_check_grace_period        = 0 -> 60
        id                               = "actions-runner-20250505203133193000000009-KWX4No"
        name                             = "actions-runner-20250505203133193000000009-KWX4No"
        # (30 unchanged attributes hidden)

      ~ warm_pool {
          ~ max_group_prepared_capacity = 3 -> 2
            # (2 unchanged attributes hidden)

          ~ instance_reuse_policy {
              ~ reuse_on_scale_in = false -> true
            }
        }

        # (13 unchanged blocks hidden)
    }

  # module.actions-runner-noble.aws_autoscaling_policy.scale_out will be updated in-place
  ~ resource "aws_autoscaling_policy" "scale_out" {
      ~ cooldown                  = 0 -> 180
        id                        = "scale-out-idle-runners"
        name                      = "scale-out-idle-runners"
        # (9 unchanged attributes hidden)
    }

  # module.actions-runner.module.record_metric.aws_lambda_function.lambda will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "actions-runner-20250505203133108100000007-INx3ry_record_metric"
      ~ last_modified                  = "2025-05-13T20:35:00.000+0000" -> (known after apply)
      ~ s3_key                         = "00be4eb3-3a13-f57e-b6d8-e9d970c9089b.zip" -> "6d923806-98bf-d4d6-156e-136fd3b3e8ea.zip"
        tags                           = {
            "account"           = "303467602807"
            "asg_name"          = "actions-runner-20250505203133108100000007-INx3ry"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.actions-runner.module.record_metric.aws_s3_object.lambda_package will be created
  + resource "aws_s3_object" "lambda_package" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "infrahouse-action-runner-lambda-20250505203126570200000001"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "6d923806-98bf-d4d6-156e-136fd3b3e8ea.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = ".terraform/modules/actions-runner/modules/record_metric/6d923806-98bf-d4d6-156e-136fd3b3e8ea.zip"
      + storage_class          = (known after apply)
      + tags                   = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250505203133108100000007-INx3ry"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all               = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250505203133108100000007-INx3ry"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + version_id             = (known after apply)
    }

  # module.actions-runner-noble.module.deregistration.data.archive_file.lambda will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "lambda" {
      + excludes            = [
          + "__pycache__",
        ]
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = (known after apply)
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = ".terraform/modules/actions-runner-noble/modules/runner_deregistration/lambda"
      + type                = "zip"
    }

  # module.actions-runner-noble.module.deregistration.aws_lambda_function.lambda will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "actions-runner-20250505203133193000000009-KWX4No_deregistration"
      ~ last_modified                  = "2025-05-15T17:22:24.000+0000" -> (known after apply)
      ~ s3_key                         = "e1cf67a3-4369-f06c-4e19-9c367299caf5.zip" -> (known after apply)
        tags                           = {
            "account"           = "303467602807"
            "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
        # (28 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.actions-runner-noble.module.deregistration.aws_s3_object.lambda_package must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      + acl                           = (known after apply)
      ~ arn                           = "arn:aws:s3:::infrahouse-action-runner-lambda-20250505203126845000000003/e1cf67a3-4369-f06c-4e19-9c367299caf5.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "binary/octet-stream" -> (known after apply)
      ~ etag                          = "fb68c33dd7a9ff804238f7b67458ecb5-5" -> (known after apply)
      ~ id                            = "e1cf67a3-4369-f06c-4e19-9c367299caf5.zip" -> (known after apply)
      ~ key                           = "e1cf67a3-4369-f06c-4e19-9c367299caf5.zip" -> (known after apply) # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = ".terraform/modules/actions-runner-noble/modules/runner_deregistration/e1cf67a3-4369-f06c-4e19-9c367299caf5.zip" -> (known after apply)
      ~ storage_class                 = "STANDARD" -> (known after apply)
        tags                          = {
            "account"           = "303467602807"
            "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
      + version_id                    = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.actions-runner-noble.module.deregistration.null_resource.install_python_dependencies must be replaced
-/+ resource "null_resource" "install_python_dependencies" {
      ~ id       = "4972007766221458769" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "dependencies_version" = "34bff39de72b4ecc4ae42adb06cd966d" -> "6538831741a0f02462174590f7abb061"
            # (1 unchanged element hidden)
        }
    }

  # module.actions-runner-noble.module.deregistration.random_uuid.lamda_src_hash must be replaced
-/+ resource "random_uuid" "lamda_src_hash" {
      ~ id      = "e1cf67a3-4369-f06c-4e19-9c367299caf5" -> (known after apply)
      ~ keepers = { # forces replacement
          ~ "requirements.txt" = "34bff39de72b4ecc4ae42adb06cd966d" -> "6538831741a0f02462174590f7abb061"
            # (1 unchanged element hidden)
        }
      ~ result  = "e1cf67a3-4369-f06c-4e19-9c367299caf5" -> (known after apply)
    }

  # module.actions-runner-noble.module.record_metric.data.archive_file.lambda will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "lambda" {
      + excludes            = [
          + "__pycache__",
        ]
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = (known after apply)
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = ".terraform/modules/actions-runner-noble/modules/record_metric/lambda"
      + type                = "zip"
    }

  # module.actions-runner-noble.module.record_metric.aws_lambda_function.lambda will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "actions-runner-20250505203133193000000009-KWX4No_record_metric"
      ~ last_modified                  = "2025-05-15T17:22:36.000+0000" -> (known after apply)
      ~ s3_key                         = "f534e7a2-73ae-c981-8e9e-ef9f2c313c7e.zip" -> (known after apply)
        tags                           = {
            "account"           = "303467602807"
            "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.actions-runner-noble.module.record_metric.aws_s3_object.lambda_package must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      + acl                           = (known after apply)
      ~ arn                           = "arn:aws:s3:::infrahouse-action-runner-lambda-20250505203126845000000003/f534e7a2-73ae-c981-8e9e-ef9f2c313c7e.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "binary/octet-stream" -> (known after apply)
      ~ etag                          = "97f190e32f3308a7c91f7522e335a3f4-5" -> (known after apply)
      ~ id                            = "f534e7a2-73ae-c981-8e9e-ef9f2c313c7e.zip" -> (known after apply)
      ~ key                           = "f534e7a2-73ae-c981-8e9e-ef9f2c313c7e.zip" -> (known after apply) # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = ".terraform/modules/actions-runner-noble/modules/record_metric/f534e7a2-73ae-c981-8e9e-ef9f2c313c7e.zip" -> (known after apply)
      ~ storage_class                 = "STANDARD" -> (known after apply)
        tags                          = {
            "account"           = "303467602807"
            "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
      + version_id                    = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.actions-runner-noble.module.record_metric.null_resource.install_python_dependencies must be replaced
-/+ resource "null_resource" "install_python_dependencies" {
      ~ id       = "5572256622108462197" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "dependencies_version" = "34bff39de72b4ecc4ae42adb06cd966d" -> "6538831741a0f02462174590f7abb061"
            # (1 unchanged element hidden)
        }
    }

  # module.actions-runner-noble.module.record_metric.random_uuid.lamda_src_hash must be replaced
-/+ resource "random_uuid" "lamda_src_hash" {
      ~ id      = "f534e7a2-73ae-c981-8e9e-ef9f2c313c7e" -> (known after apply)
      ~ keepers = { # forces replacement
          ~ "requirements.txt" = "34bff39de72b4ecc4ae42adb06cd966d" -> "6538831741a0f02462174590f7abb061"
            # (1 unchanged element hidden)
        }
      ~ result  = "f534e7a2-73ae-c981-8e9e-ef9f2c313c7e" -> (known after apply)
    }

  # module.actions-runner-noble.module.registration.data.archive_file.lambda will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "lambda" {
      + excludes            = [
          + "__pycache__",
        ]
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = (known after apply)
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = ".terraform/modules/actions-runner-noble/modules/runner_registration/lambda"
      + type                = "zip"
    }

  # module.actions-runner-noble.module.registration.aws_lambda_function.main will be updated in-place
  ~ resource "aws_lambda_function" "main" {
        id                             = "actions-runner-20250505203133193000000009-KWX4No_registration"
      ~ last_modified                  = "2025-05-15T17:22:24.000+0000" -> (known after apply)
      ~ s3_key                         = "7c1db828-ad0f-dbc6-3235-6b872efdeea1.zip" -> (known after apply)
        tags                           = {
            "account"           = "303467602807"
            "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
        # (28 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.actions-runner-noble.module.registration.aws_s3_object.lambda_package must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      + acl                           = (known after apply)
      ~ arn                           = "arn:aws:s3:::infrahouse-action-runner-lambda-20250505203126845000000003/7c1db828-ad0f-dbc6-3235-6b872efdeea1.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "binary/octet-stream" -> (known after apply)
      ~ etag                          = "0484754f10c89e3aaf40deb95316d23c-5" -> (known after apply)
      ~ id                            = "7c1db828-ad0f-dbc6-3235-6b872efdeea1.zip" -> (known after apply)
      ~ key                           = "7c1db828-ad0f-dbc6-3235-6b872efdeea1.zip" -> (known after apply) # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = ".terraform/modules/actions-runner-noble/modules/runner_registration/7c1db828-ad0f-dbc6-3235-6b872efdeea1.zip" -> (known after apply)
      ~ storage_class                 = "STANDARD" -> (known after apply)
        tags                          = {
            "account"           = "303467602807"
            "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
      + version_id                    = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.actions-runner-noble.module.registration.null_resource.install_python_dependencies must be replaced
-/+ resource "null_resource" "install_python_dependencies" {
      ~ id       = "5211993523682709807" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "dependencies_version" = "34bff39de72b4ecc4ae42adb06cd966d" -> "c9bc5cebad6b81307c300f8d1e09723a"
          ~ "main_version"         = "cfe52089dc4c9e78f304e673a993d130" -> "f9ec518ccebbfddf2a90c8883410c99b"
        }
    }

  # module.actions-runner-noble.module.registration.random_uuid.lamda_src_hash must be replaced
-/+ resource "random_uuid" "lamda_src_hash" {
      ~ id      = "7c1db828-ad0f-dbc6-3235-6b872efdeea1" -> (known after apply)
      ~ keepers = { # forces replacement
          ~ "main.py"          = "cfe52089dc4c9e78f304e673a993d130" -> "f9ec518ccebbfddf2a90c8883410c99b"
          ~ "requirements.txt" = "34bff39de72b4ecc4ae42adb06cd966d" -> "c9bc5cebad6b81307c300f8d1e09723a"
        }
      ~ result  = "7c1db828-ad0f-dbc6-3235-6b872efdeea1" -> (known after apply)
    }

Plan: 10 to add, 7 to change, 9 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgImFkZCI6IDEwLCAiY2hhbmdlIjogNywgImRlc3Ryb3kiOiA5fX0=
```
</details>